using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace notepad
{
    class Program
    {
        static void Main(string[] args)
        {
            /// Разработать ежедневник.
            /// В ежедневнике реализовать возможность 
            /// - создания
            /// - удаления
            /// - реактирования 
            /// записей
            /// 
            /// В отдельной записи должно быть не менее пяти полей
            /// 
            /// Реализовать возможность 
            /// - Загрузки данных из файла
            /// - Выгрузки данных в файл
            /// - Добавления данных в текущий ежедневник из выбранного файла
            /// - Импорт записей по выбранному диапазону дат
            /// - Упорядочивания записей ежедневника по выбранному полю

            // 1. Структура одной записи
            //      1) Наименование
            //      2) ДатаВремя
            //      3) Описание
            //      4) Владелец
            //      5) Важность - Низкая, Обычная, Высокая
            // 2. Структура обработки файлов
            // 3. Структура обработки записей
            // 4. 




        }
    }
}
